In [3]:
import site
site.getsitepackages()

['c:\\ProgramData\\anaconda3',
 'c:\\ProgramData\\anaconda3\\Lib\\site-packages']

In [2]:
import sys
import pandas as pd
import numpy as np
import seaborn as sns

print(sys.version)
print(pd.__version__)
print(np.__version__)
print(sns.__version__)

3.11.7 | packaged by Anaconda, Inc. | (main, Dec 15 2023, 18:05:47) [MSC v.1916 64 bit (AMD64)]
2.1.4
1.26.4
0.12.2

In [5]:
!pip install koreanize_matplotlib

Requirement already satisfied: koreanize_matplotlib in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (0.1.1)
Requirement already satisfied: matplotlib in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from koreanize_matplotlib) (3.8.4)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (1.2.1)
Requirement already satisfied: cycler>=0.10 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (4.50.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (1.4.5)
Requirement already satisfied: numpy>=1.21 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from matplotlib->koreanize_matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\유소희\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.7->matplotlib->koreanize_matplotlib) (1.16.0)

[notice] A new release of pip is available: 23.1.2 -> 24.0
[notice] To update, run: C:\Users\유소희\AppData\Local\Programs\Python\Python311\python.exe -m pip install --upgrade pip

In [6]:
%config InlineBackend.figure_format='retina'

## 05-2 (p113) 시험예상

In [8]:
df_raw=pd.DataFrame({'var1': [1,2,1],
                    'var2': [2,3,2],
                    'var3': [10,20,30]})
df_raw

   var1  var2  var3
0     1     2    10
1     2     3    20
2     1     2    30

In [9]:
df_new=df_raw.copy()
df_new

   var1  var2  var3
0     1     2    10
1     2     3    20
2     1     2    30

In [10]:
df_new.rename(columns={'var2': 'v2'})

   var1  v2  var3
0     1   2    10
1     2   3    20
2     1   2    30

In [11]:
df_new.rename(columns={'var1':'곽준혁'})

   곽준혁  var2  var3
0    1     2    10
1    2     3    20
2    1     2    30

In [12]:
df_new.rename(columns={'var2':'v2'}, inplace=True) #덮어쓰기
df_new

   var1  v2  var3
0     1   2    10
1     2   3    20
2     1   2    30

In [13]:
df_new

   var1  v2  var3
0     1   2    10
1     2   3    20
2     1   2    30

In [15]:
df_raw

   var1  var2  var3
0     1     2    10
1     2     3    20
2     1     2    30

In [17]:
df_new.rename(columns={'var1':'곽준혁'}, inplace=True)
df_new

   곽준혁  v2  var3
0    1   2    10
1    2   3    20
2    1   2    30

In [20]:
df_new.rename(index={0:'유소희', 1:'까미', 2:'z'}, inplace=True)
df_new

     곽준혁  v2  var3
유소희    1   2    10
까미     2   3    20
z      1   2    30

In [29]:
df_new.rename(columns={'var3':'곽준서'}, inplace=True)
df_new

     곽준혁  v2  곽준서
유소희    1   2   10
까미     2   3   20
z      1   2   30

In [34]:
df=pd.DataFrame({"A":[1,2,3], "B":[4,5,6]})
df.rename(columns={"A":'곽준혁', "B":'유소희'}, inplace=True)

In [36]:
df.rename(index={0:'까미'}, inplace=True)
df

    곽준혁  유소희
까미    1    4
1     2    5
2     3    6

--------------------------------
## 05-3 파생변수 만들기

In [38]:
df=pd.DataFrame({'v1': [1,2,3],
                 'v2': [4,5,6]})
df

   v1  v2
0   1   4
1   2   5
2   3   6

In [39]:
df1=df.copy()
df1

   v1  v2
0   1   4
1   2   5
2   3   6

In [40]:
df1['v_sum']=df1['v1']+df1['v2']
df1

   v1  v2  v_sum
0   1   4      5
1   2   5      7
2   3   6      9

In [41]:
df1['v_mean']=(df1['v1']+df1['v2'])/2
df1

   v1  v2  v_sum  v_mean
0   1   4      5     2.5
1   2   5      7     3.5
2   3   6      9     4.5

In [42]:
df2=df.copy()
df2

   v1  v2
0   1   4
1   2   5
2   3   6

In [43]:
df2.sum()

v1     6
v2    15
dtype: int64

In [44]:
df2.sum(axis=1)

0    5
1    7
2    9
dtype: int64

In [45]:
df2.sum(axis=0)

v1     6
v2    15
dtype: int64

In [47]:
df2['my_sum']=df2.sum(axis='columns')
df2

   v1  v2  my_sum
0   1   4      10
1   2   5      14
2   3   6      18

In [49]:
df['my_sum']=df.sum(axis='columns')
df

   v1  v2  my_sum
0   1   4       5
1   2   5       7
2   3   6       9

In [50]:
df2[['v1','v2']]

   v1  v2
0   1   4
1   2   5
2   3   6

In [51]:
df2['my_mean']=df2[['v1', 'v2']].mean(axis=1)
df2

   v1  v2  my_sum  my_mean
0   1   4      10      2.5
1   2   5      14      3.5
2   3   6      18      4.5

In [52]:
df2['my_mean']=df2[['v1', 'v2']].mean(axis=0)
df2

   v1  v2  my_sum  my_mean
0   1   4      10      NaN
1   2   5      14      NaN
2   3   6      18      NaN

In [54]:
df['my_mean']=df[['v1','v2']].mean(axis=1)
df

   v1  v2  my_sum  my_mean
0   1   4       5      2.5
1   2   5       7      3.5
2   3   6       9      4.5